<template>
    <div class="cn-shop--gray cn-shop--wrap cn-shop--split">
        <div>
            <div class="simple s-menu e-box">
                <a href="">
                    <span>
                        <span class="s-menu--text">
                            Перевозка животных
                        </span>
                    </span>
                </a>
                <a href="">
                    <span>
                        <span class="s-menu--text">
                            Подготовка животных к отправке
                        </span>
                    </span>
                </a>
                <a class="active" href="">
                    <span>
                        <span class="s-menu--text">
                            Отправка животного
                        </span>
                    </span>
                </a>
                <a href="">
                    <span>
                        <span class="s-menu--text">
                            Ветеринарное страхование
                        </span>
                    </span>
                </a>
                <a href="">
                    <span>
                        <span class="s-menu--text">
                            Стоимость
                        </span>
                    </span>
                </a>
            </div>
        </div>
        <div>
            <h4 class="size--24 weight--700 style--uppercase style--center margin--bottom-15">
                Перевозка животных
            </h4>
            <p class="style--center line-height--1_6 margin--bottom-55">
                Международные и внутренние перевозки любимых питомцев. Безопасность перевозки животного — это первостепенная задача, {{ shop.name }} предпримет все необходимые ресурсы и опыт для того, чтобы Вы и ваш питомец остались довольны процессом перевозки. Мы являемся членами IPATA (Международная ассоциация перевозки животных) и строго соблюдаем правила и положения Закона о защите животных.
            </p>
            <div class="grid grid--gap margin--bottom-50 grid--three">
                <div>
                    <img class="img-fluid" src="/img/exp/1.png" alt="">
                </div>
                <div>
                    <img class="img-fluid" src="/img/exp/2.png" alt="">
                </div>
                <div>
                    <img class="img-fluid" src="/img/exp/3.png" alt="">
                </div>
            </div>
            <div class="style--center">
                <h4 class="size--24 weight--700 style--uppercase margin--bottom-15">
                    Подготовка животных к отправке
                </h4>
                <p class="line-height--1_6 margin--bottom-10">
                    Прежде чем планировать перевозку животного необходимо убедится в следующих параметрах:
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-20">
                    — Некоторые страны имеют строгие ограничения или даже запрет на ввоз животных, поэтому рекомендуем заранее поинтересоваться правилами их ввоза в страну назначения. Ввоз животных и птиц в страны ЕС подразумевает обязательное чипирование – микрочипами стандарта ISO 11784 для собак и кошек, микрочипы стандарты ISO 11785 предназначены для хорьков.
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-20">
                    — Убедитесь, что все необходимые документы на питомца оформлены: паспорт животного с отметками прививок не менее чем за 30 дней до своей поездки и не более года должно пройти с момента последней вакцинации (бешенство, собачьи/кошачьи болезни).
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-20">
                    — Обязательным при перевозках является: ветеринарное свидетельство (форма № 1), ветеринарный паспорт, ветеринарный сертификат (евро сертификат), свидетельствующий о прививках, обработках и здоровье животного. В зависимости от страны назначения, необходимым может быть наличие чипа, разрешения на ввоз/вывоз. Для вывоза животного за рубеж может потребоваться справка о том, что животное не представляет племенной ценности (при перевозке собак — справка из клуба СКОР или РКФ).
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-50">
                    — Необходимым условием транспортировки животного является наличие специального транспортного контейнера, который соответствует требованиям IATA (Международная Ассоциация Воздушного Транспорта). Размер контейнера должен позволять животному вставать в полный рост и поворачиваться на 360 градусов. Дно контейнера должно быть водонепроницаемым и покрытым абсорбирующим материалом. Контейнер необходимо обклеить соответствующей маркировкой.
                </p>
                <p class="line-height--1_6 margin--bottom-20">
                    Согласно правилам IATA к перевозке не принимаются следующие породы кошек и собак (брахицефальные породы):
                </p>
            </div>
            <div class="grid grid--gap e-jaw--wrap margin--bottom-50">
                <div class="e-jaw" style="background-image: url('/img/exp/4.png')">
                    <div class="e-jaw--box">
                        <h4 class="e-jaw--title">
                            Собаки
                        </h4>
                        <ul>
                            <li>— Мопс</li>
                            <li>— Пекинес</li>
                            <li>— Ши-тцу</li>
                            <li>— Боксер</li>
                            <li>— Бостонтерьер</li>
                            <li>— Бардовский дог</li>
                            <li>— Японский хин</li>
                            <li>— Грифон (бельгийский, брюссельский)</li>
                            <li>— Бульдог (английский, французский, американский</li>
                        </ul>
                    </div>
                </div>
                <div class="e-jaw" style="background-image: url('/img/exp/5.png')">
                    <div class="e-jaw--box">
                        <h4 class="e-jaw--title">
                            Кошки
                        </h4>
                        <ul>
                            <li>— Гималайская</li>
                            <li>— Персидская</li>
                            <li>— Шотландская</li>
                            <li>— Экзотическая короткошерстная</li>
                            <li>— Британская короткошерстная кошка</li>
                        </ul>
                    </div>
                </div>
            </div>
            <div class="style--center">
                <h4 class="size--24 weight--700 style--uppercase margin--bottom-15">
                    Отправка животного
                </h4>
                <p class="line-height--1_6 size--14 style--italic margin--bottom-20">
                    — Как только мы заключим официальный договор и утвердим дату отправки, Вашим питомцем займется наш сертифицированный менеджер. Все наши менеджеры по направлению – LIVE ANIMAL имеют собственных животных, таким образом Ваш четвероногий друг находится в заботливых и надёжных руках.
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-20">
                    — Далеко не все авиакомпании (перевозчики) предоставляют услугу перевозки животных. Всего в официальном реестре IPATA порядка 24 авиакомпаний которые осуществляют перевозку животных. {{ shop.name }} является официальным авиа агентом компании Lufthansa Cargo, что в свою очередь позволяет нам заблаговременно бронировать животное на конкретный рейс.
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-20">
                    — Мы заберём Вашего питомца из дома в специальном транспортном боксе для животных, доставим в аэропорт отправления, пройдем таможенное оформление, пройдем ветеринарный контроль, почистим клетку (выгул, корм, уход) и разместим животное на борт воздушного судна в специальный отсек с регулируемой температурой в сопровождении нашего менеджера.
                </p>
                <p class="size--14 style--italic line-height--1_6 margin--bottom-50">
                    — Как правило транзитное время полёта в страны Европы занимает от 2 часов, трансконтинентальные перелёты от 9-ти часов. Доставка в аэропорт назначения или доставка до двери Вашего дома.
                </p>
                <h4 class="size--24 weight--700 style--uppercase margin--bottom-15">
                    Ветеринарное страхование
                </h4>
                <p class="line-height--1_6 margin--bottom-55">
                    {{ shop.name }} по вашему желанию оформит страховой полис «За все риски», дополнительно в страховое покрытие включается риск гибели животных в результате несчастного случая во время перевозки. Под несчастным случаем понимаются травматические повреждения несовместимые с жизнью, либо приведшие к выбраковке животных: солнечный/тепловой удар, удушение (асфиксия), замерзание (переохлаждение организма в результате опасного природного гидрометеорологического явления), травматические повреждения, укус ядовитых насекомых.
                </p>
            </div>
            <div class="e-box e-box--padding sp-price">
                <div class="style--center sp-price--par">
                    <h4 class="size--24 weight--700 style--uppercase margin--bottom-15 margin--top-25">
                        Стоимость
                    </h4>
                    <p class="line-height--1_6">
                        Тарифы на перевозку животных без сопровождения указаны за минимальный оплачиваемый вес - 25 кг с учётом переноски.
                    </p>
                </div>
                <div class="sp-price--clause">
                    <table class="e-table size--13">
                        <thead>
                            <tr>
                                <th>Город назначения</th>
                                <th>Тариф</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>Архангельск</td>
                                <td>5265 руб.</td>
                            </tr>
                            <tr>
                                <td>Екатеринбург</td>
                                <td>6222 руб.</td>
                            </tr>
                            <tr>
                                <td>Казань</td>
                                <td>5265 руб.</td>
                            </tr>
                            <tr>
                                <td>Калининград</td>
                                <td>6222 руб.</td>
                            </tr>
                            <tr>
                                <td>Краснодар</td>
                                <td>5265 руб.</td>
                            </tr>
                            <tr>
                                <td>Красонярск</td>
                                <td>6222 руб.</td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
import { mapState } from 'vuex';

export default {
    computed: {
        ...mapState({
            shop: state => state.shops.shop
        })
    }
}
</script>

