<template>
    <LayoutMain>
        <div class="pa-head">
            <div class="pa-head--gage">
                <h3 class="size--30 weight--700 pa-head--sector">
                    О нас
                </h3>
                <p class="pa-head--too">
                    <span class="weight--700">Дорогие друзья, </span>
                    <span>
                        группой единомышленников из разных стран было создано удобное и дружественное пространство, максимально комфортное и удобное для владельцев домашних животных, заводчиков, людей, желающих завести себе друга или просто симпатизирующих братьям нашим меньшим.
                    </span>
                </p>
                <p class="pa-head--too">
                    Сами являясь владельцами различных домашних питомцев, от питбуля Расмуса и кошки Хлоэ, до мышки Фроси и черепашки Розалинды, мы сконструировали сайт таким образом, чтобы вся необходимая информация была в одном месте, всегда под рукой и с максимально удобным функционалом.
                </p>
                <p class="pa-head--too">
                    Ресурс можно условно разделить на 3 основных раздела.
                </p>
            </div>
        </div>
        <div class="cn-main cn-main--simple">
            <div class="pa-body">
                <div class="pa-body--group">
                    <h4 class="e-marker--daisy e-marker">
                        <span class="e-marker--motto">маркет</span>
                    </h4>
                    <p class="style--center line-height--1_6 pa-body--text">
                        Удобная и дружелюбная площадка для поиска и размещения питомцев на продажу, а также всех необходимых сопутствующих товаров и услуг. Возможность объединяться в кооперативы заводчиков, создавать онлайн-магазины, имиджевую страничку своего сервиса или полноценную страницу услуг, например, ветеринарной клиники, салона грумминга, зоогостиницы или частной передержки.
                    </p>
                    <p class="style--center line-height--1_6 pa-body--text">
                        Для получения максимально подробной информации по товарам/услугам и предлагаемых питомцев, можно перейти в раздел
                    </p>
                </div>
                <div class="pa-body--group">
                    <h4 class="e-marker--green e-marker">
                        <span class="e-marker--motto">Сообщество</span>
                    </h4>
                    <div class="style--center pa-body--text e-more">
                        <span class="line-height--1_6">
                            Где можно найти полнейшую и подробнейшую информация по каждому Питомцу, с момента рождения, его Заводчику, Хозяину, Питомнику, подобрать друзей по интересам или, даже, найти себе пару. Таким образом, Покупатель Питомца становится не просто счастливым обладателем нового члена семьи, но и получает возможность в одном пространстве приобрести все необходимое для его, Питомца, счастливой жизни. А также рекомендации, статьи, обсуждения, помощь, поддержку и широчайший круг общения согласно виду Питомца, Породе или любым другим интересам
                        </span>
                        <span class="e-more--show line-height--1_6">
                            Где можно найти полнейшую и подробнейшую информация по каждому Питомцу, с момента рождения, его Заводчику, Хозяину, Питомнику, подобрать друзей по интересам или, даже, найти себе пару. Таким образом, Покупатель Питомца становится не просто счастливым обладателем нового члена семьи, но и получает возможность в одном пространстве приобрести все необходимое для его, Питомца, счастливой жизни. А также рекомендации, статьи, обсуждения, помощь, поддержку и широчайший круг общения согласно виду Питомца, Породе или любым другим интересам
                        </span>
                        <span class="color--regent-gray size--14 e-more--toggle">
                            Подробнее
                        </span>
                        <i class="gray prefab--arrow-down e-more--button"></i>
                    </div>
                    <h4 class="size--14 weight--600 style--italic style--center pa-body--text">
                        Итак, что мы имеем:
                    </h4>
                    <ul class="style--italic style--center size--14 e-list e-list--italic line-height--1_4">
                        <li>— три типа аккаунга: Стандартный, Питомец, Заводчик.</li>
                        <li>— для Заводчиков: возможность создание мультиаккаунта, с персональной активной страничкой для КАЖДОГО своего питомца.</li>
                        <li>— информация о вашем питомце, от рождения до наград и потомства.</li>
                        <li>— ветеринарный паспорт вашего питомца, с функцией печати.</li>
                        <li>— родословная, с функцией печати.</li>
                        <li>— загрузка фотографий и видео без ограничений по количеству и качеству.</li>
                        <li>— поиск ближайших родственников.</li>
                        <li>— поиск пары для вязки (возможен только с родословной).</li>
                        <li>— возможность продажи и покупки питомцев, согласно желаемым требованиям (кроме стоимости).</li>
                        <li>— возможность создания страницы нового помета, с активной ссылкой на странице Заводчика (помет А, помет 6, помет 8 ...), который, таким образом, не останется е информационном забвении под слоями новых постов свежих пометов, а отдельно, с мгновенным доступом к фотографиям, родословной w еидео первых шагов ваших питомцев.</li>
                        <li>— возможность общения как со своей личной страницы Заводчика, таки со страницы своего питомца.</li>
                        <li>— образование и поиск групп по интересам (порода, место жительства, место прогулок, родственные связи и т.д.).</li>
                        <li>— возможность найти себе питомца из приюта, предварительно просмотрев его профиль - фотографии, историю, ветпаспорт, привычки, ограничения и рекомендации по содержанию.</li>
                        <li>— кнопка SOS, е случае экстренной ситуации пропажи и поиску питомца, срочном пристройстве животных из питомников, с сортировкой информации по виду животного, породе, город}.</li>
                    </ul>
                </div>
                <div class="pa-body--group">
                    <div class="e-box pa-step">
                        <p class="style--center pa-step--cry">
                            Вся информация (родословная, вет.паспорт, данные питомца и сама страница в целом) имеет различные степени доступа
                        </p>
                        <div class="pa-step--make">
                            <div class="pa-step--exile">
                                <div class="pa-step--talk">
                                    <span class="pa-step--say">1</span>
                                </div>
                                <span class="pa-step--gossip">Закрыто для всех</span>
                            </div>
                            <div class="pa-step--exile">
                                <div class="pa-step--talk">
                                    <span class="pa-step--say">2</span>
                                </div>
                                <span class="pa-step--gossip">Открыто для друзей</span>
                            </div>
                            <div class="pa-step--exile">
                                <div class="pa-step--talk">
                                    <span class="pa-step--say">3</span>
                                </div>
                                <span class="pa-step--gossip">Открыто для всех</span>
                            </div>
                            <div class="pa-step--exile">
                                <div class="pa-step--talk">
                                    <span class="pa-step--say">4</span>
                                </div>
                                <span class="pa-step--gossip">Персональный доступ</span>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="pa-body--group">
                    <h4 class="e-marker--blue e-marker">
                        <span class="e-marker--motto">База данных</span>
                    </h4>
                    <p class="style--center line-height--1_6 pa-body--text">
                        Возможность найти любого питомца, выбрав вид, породу, пол, страну и город нахождения. И сразу перейти в его Профиль в разделе Сообщество.
                    </p>
                </div>
                <div class="pa-body--group">
                    <h4 class="e-marker--yelow e-marker">
                        <span class="e-marker--motto">Нет предела совершенству</span>
                    </h4>
                    <p class="style--center line-height--1_6 pa-body--text">
                        Наша команда нацелена на постоянную работу по улучшению сайта, поэтому, все ваши оценки, пожелания и рекомендации будут с радостью восприняты, внимательно рассмотрены, изучены и, по необходимости, внедрены. В разработке постоянно имеется много различных опций и дополнений, полезных, удобных и приятных.
                    </p>
                    <p class="pa-qqute">
                        Мы допускаем возможность ошибок, к примеру, в названиях и количестве пород, поэтому будем признательны за помощь в исправлении и сообщения, с указанием корректной информации.
                    </p>
                </div>
                <div class="pa-body--group">
                    <h4 class="e-marker--red e-marker">
                        <span class="e-marker--motto">Кнопка экстренной помощи</span>
                    </h4>
                    <p class="style--center line-height--1_6 pa-body--text">
                        Кнопка SOS, в случае экстренной ситуации пропажи и поиску питомца, срочном пристройстве животных, с сортировкой информации по виду животного, породе, стране, городу.
                    </p>
                </div>
            </div>
        </div>
    </LayoutMain>
</template>

<script>
import LayoutMain from '../layouts/LayoutMain';

export default {
    components: {
        LayoutMain
    }
}
</script>
