app/PetPassport/Controllers/Api/LikesController.php

update `likes` set `deleted_at` = '2020-06-17 14:18:42', `likes`.`updated_at` = '2020-06-17 14:18:42' where `object_id` = 14 and `object_type` = 'post' and `user_id` = 1 and `likes`.`deleted_at` is null
select * from `posts` where 0 = 1 and `posts`.`deleted_at` is null
---
    public function dislike(Request $request)
    {
        $user = $request->user();
        $objectId = $request->get('object_id');
        $objectType = $request->get('object_type');
        $query = Like::query();
        $query->where('object_id', $objectId);
        $query->where('object_type', $objectType);
        $query->where('user_id', $user->id);
        $query->delete();
        if ($objectType === 'community') {
            Community::where('id', $objectId)->decrement('rating');
        }
        if ($objectType === 'post') {
            $post = Post::withCount('likes')->find($objectId);