app/PetPassport/Controllers/Api/PostsController.php

    public function store(Request $request)
    {
        $post = new Post;
        $post->fill($request->input());
        $post->save();
---
insert into `posts` (`sos`, `type`, `body`, `owner_type`, `privacy`, `wall_id`, `wall_type`, `owner_id`, `updated_at`, `created_at`) values (0, 1, 'hjkjhkjhkjhkjh', 'profile', 0, '1', 'profile', 1, '2020-06-16 18:54:18', '2020-06-16 18:54:18')

    public function update(Request $request, $id)
    {
        // TODO access check
        $post = Post::find($id);
        $post->fill($request->input());
        $post->save();
---
update `posts` set `privacy` = 0, `posts`.`updated_at` = '2020-06-17 14:28:42' where `id` = 14

    public function destroy( $id)
    {
        // TODO access check
        $post = Post::find($id);
---
select * from `posts` where 0 = 1 and `posts`.`deleted_at` is null