app/PetPassport/Controllers/Api/ProfilesController.php

                    ]);
                }

                $friends_count = UserFriend::where(function ($query) use ($userProfile) {
                    $query->where('user_id', $userProfile->user_id);
                    $query->orWhere('friend_id', $userProfile->user_id);
                })->where('accepted', true)->count();
---
select count(*) as aggregate from `user_friends` where (`user_id` = 1 or `friend_id` = 1) and `accepted` = 1 and `user_friends`.`deleted_at` is null

                    $profile = array_merge($profile, $petProfile->toArray());
                }

                $pages_count = Like::where('object_type', 'community')->where('user_id', $userProfile->user_id)->count();
                $groups_count = CommunityMember::where('user_id', $userProfile->user_id)->whereHas('community', function ($query) {
                    $query->where('type', 1);
                })->count();
                $nurseries_count = CommunityMember::where('user_id', $userProfile->user_id)->whereHas('community', function ($query) {
                    $query->where('type', 2);
                })->count();
---
select count(*) as aggregate from `likes` where `object_type` = 'community' and `user_id` = 1 and `likes`.`deleted_at` is null
select count(*) as aggregate from `community_members` where `user_id` = 1 and exists (select * from `communities` where `community_members`.`community_id` = `communities`.`id` and `type` = 1 and `communities`.`deleted_at` is null)
select count(*) as aggregate from `community_members` where `user_id` = 1 and exists (select * from `communities` where `community_members`.`community_id` = `communities`.`id` and `type` = 2 and `communities`.`deleted_at` is null)