app/PetPassport/Models/Post.php

select * from `user_friends` where (`user_id` = 1 or `friend_id` = 1) and `accepted` = 1 and `user_friends`.`deleted_at` is null
---
    public function scopePrivacyCheck($query, $user_id = null)
    {
        $user_id = auth('api')->id();
        $ids = [];
        if ($user_id) {
            $friendships = UserFriend::where(function ($query) use ($user_id) {
                $query->where('user_id', $user_id);
                $query->orWhere('friend_id', $user_id);
            })
            ->where('accepted', true)
            ->get();