app/PetPassport/Models/User/UserProfile.php

    public function getTopFriendsAttribute()
    {
        $profile = $this;
        $friendships = UserFriend::where(function ($query) use ($profile) {
            $query->where('user_id', $profile->user_id);
            $query->orWhere('friend_id', $profile->user_id);
        })->where('accepted', true)
            ->limit(9);
        $ids1 = $friendships->pluck('user_id');
        $ids2 = $friendships->pluck('friend_id');
        $ids = array_diff($ids1->merge($ids2)->toArray(), [$profile->user_id]);
        return self::select([
            'user_id',
            'slug',
            'name',
            //'avatar'
        ])->whereIn('user_id', $ids)
            ->get();
---
select `user_id` from `user_friends` where (`user_id` = 1 or `friend_id` = 1) and `accepted` = 1 and `user_friends`.`deleted_at` is null limit 9
select `user_id`, `slug`, `name` from `user_profiles` where 0 = 1

    private function loadFriendIds()
    {
        if ($this->friend_ids !== null) return;
        $user_id = $this->user_id;
        $friendships = UserFriend::where(function ($query) use ($user_id) {
            $query->where('user_id', $user_id);
            $query->orWhere('friend_id', $user_id);
        })->where('accepted', true)
            ->get();
---
select * from `user_friends` where (`user_id` = 1 or `friend_id` = 1) and `accepted` = 1 and `user_friends`.`deleted_at` is null

    public function getRecommendedGroupsAttribute()
    {
        $this->loadFriendIds();
        $user_id = $this->user_id;
        $recommended = [];
        $ids = [];
        if (count($this->friend_ids)) {
            $query = CommunityMember::query();
            $query->selectRaw('COUNT(community_id) as community_id_count, community_id');
            $query->whereIn('user_id', $this->friend_ids);
            $query->whereNotIn('community_id', function ($query) use ($user_id) {
                $query->select('community_id');
                $query->from(with(new CommunityMember)->getTable());
                $query->where('user_id', $user_id);
            });
            $query->whereHas('community', function ($query) {
                $query->where('type', Community::TYPES['groups']);
            });
            $query->groupBy('community_id');
            $query->orderBy('community_id_count', 'desc');
            $query->limit(5);
            $ids = $query->get()->pluck('community_id')->toArray();
        }
        $query = Community::query();
        $query->with('avatar_raw');
        $query->select(['id', 'type', 'slug', 'name']);
        if (count($ids)) {
            $query->whereIn('id', $ids);
        }
        $query->limit(5);
        return $query->get();
---
select `id`, `type`, `slug`, `name` from `communities` where `communities`.`deleted_at` is null limit 5