app/PetPassport/Models/User/UserType.php

select * from `user_types`
---
    public function getWithTranslate()
    {
        return $this->all()->map(function ($item, $key) {
            $item->name = trans('user_type.' . $item->name);
            return $item;
        });