app/PetPassport/Collections/PostCollection.php

    public function attachFlags()
    {
        $user_id = auth('api')->id();
        $ids = $this->pluck('id')->toArray();
        if (count($ids)) {
            $liked = Like::whereIn('object_id', $ids)
                ->where('object_type', 'post')
                ->where('user_id', $user_id)
                //->select('post_id')
                ->get()
                ->pluck('object_id')
                ->toArray();
            $reposted = Post::whereIn('origin_id', $ids)
                ->where('owner_id', $user_id)
                ->where('owner_type', 'profile')
                //->select('origin_id')
                ->get()
                ->pluck('origin_id')
                ->toArray();
            //dd($user_id);
            $this->map(function ($post) use ($liked, $reposted) {
                $post->liked = in_array($post->id, $liked);
                $post->reposted = in_array($post->id, $reposted);
            });
---
select * from `likes` where `object_id` in (13, 12, 11, 10, 9, 7, 6, 5, 4, 3, 2, 1) and `object_type` = 'post' and `user_id` = 1 and `likes`.`deleted_at` is null
select * from `posts` where `origin_id` in (13, 12, 11, 10, 9, 7, 6, 5, 4, 3, 2, 1) and `owner_id` = 1 and `owner_type` = 'profile' and `posts`.`deleted_at` is null
select * from `user_profiles` where `user_profiles`.`user_id` in (1)