app/PetPassport/Services/FileManagerService.php

    public function __construct(Request $request)
    {
        $this->disk = config('petpassport.filemanager.disk');
        $this->exceptFiles = collect([]);
        $this->exceptFolders = collect([]);
        $this->exceptExtensions = collect([]);
        $this->globalFilter = null;
        try {
            $this->storage = Storage::disk($this->disk);
            $user = User::where('id', $request->get('userId'))->first();
---
select * from `users` where `id` = '1' and `users`.`deleted_at` is null limit 1

                $photo->original = "/storage/users/user-{$user->id}{$fold}{$fileName}";
                $photo->original_width = $width;
                $photo->original_height = $height;
                $photo->save();
---
insert into `photos` (`section`, `owner_id`, `owner_type`, `thumb_180`, `thumb_360`, `thumb_720`, `thumb_1440`, `thumb_2880`, `original`, `original_width`, `original_height`, `updated_at`, `created_at`) values (1, 1, 'profile', '/storage/users/user-1/temp_5ILjAKIehxVRBLhab760WYJPbunW1q2N_180.png', '/storage/users/user-1/temp_5ILjAKIehxVRBLhab760WYJPbunW1q2N_360.png', '/storage/users/user-1/temp_5ILjAKIehxVRBLhab760WYJPbunW1q2N_720.png', '/storage/users/user-1/temp_5ILjAKIehxVRBLhab760WYJPbunW1q2N_1440.png', '/storage/users/user-1/temp_5ILjAKIehxVRBLhab760WYJPbunW1q2N_2880.png', '/storage/users/user-1/7.png', 287, 210, '2020-06-17 09:50:55', '2020-06-17 09:50:55')